[
    {
        "articleId": "80057281",
        "title": "Maryland Archaeologists Unearth Jesuit Plantation's 18th",
        "blurb": "Archaeologists conducting excavations at a Jesuit plantation in Maryland have unearthed roughly 300-year-old buildings that housed enslaved ...\nOct 28, 2020"
    },
    {
        "articleId": "70178217",
        "title": "The Legend of The Hell House College of St. Mary's",
        "blurb": "Hell House College is the nickname given to St. Mary's College in Ilchester, Maryland (The college is also sometimes referred to as 'Creepy ...\nNov 21, 2016"
    },
    {
        "articleId": "80007945",
        "title": "The History of the Holy Ghost Ruins",
        "blurb": "The ruins of the chapels in the old cemetery just north of Basingstoke Railway Station are a striking monument - but what is their history?\n1 month ago"
    },
    {
        "articleId": "80025172",
        "title": "The United Status of Abandoned Places",
        "blurb": "The United States of Abandoned Places. From Alabama to Wyoming, there are abandoned towns, amusement parks, and ruins lurking in your home state.\nAug 28, 2019 "
    },
    {
        "articleId": "80002311",
        "title": "Ellicott City residents still live on high alert when storms hit",
        "blurb": "Ellicott City residents still live on high alert when storms hit. Kate Ryan | @KateRyanWTOP. August 12, 2020, 7:15 PM. Share This: share on facebook · share on ...\nAug 12, 2020"
    },
    {
        "articleId": "80025384",
        "title": "Urban explorers give modern ruins a second life",
        "blurb": "Urban Explorers Give Modern Ruins a Second Life. In photos and videos, researchers and thrill-seekers celebrate the allure of abandoned ...\nJul 27, 2020"
    },
    {
        "articleId": "80050008",
        "title": "Here's the story behind the ruins in Patapsco Valley State Park",
        "blurb": "Here's the story behind the ruins in Patapsco Valley State Park. Mike Klingaman. By Mike Klingaman. Baltimore Sun |. Oct 03, 2019 at 5:00 AM ...\nOct 3, 2019"
    },
    {
        "articleId": "70242311",
        "title": "Does a mid-century bride haunt the ruins of St. Mary's College in Patapsco Valley State Park?",
        "blurb": "Today marks the 65th anniversary of the horrifying event that took place in St. Mary's College Church. It is believed that her ghost still haunts ...\nJan 21, 2019"
    },
    {
        "articleId": "80000770",
        "title": "A history spree in Ellicott City, Md.",
        "blurb": "A history spree in Ellicott City, Md. Add to list. On my list. The ruins of the Patapsco Female Institute sit on a hill overlooking the Patapsco River ...\nOct 16, 2014"
    },
    {
        "articleId": "80044950",
        "title": "What Ellicott City businesses are in the buildings slated to be razed under flood plan?",
        "blurb": "What Ellicott City businesses are in the buildings slated to be razed under flood plan? · Howard County Times: Top stories Newsletter · Latest ...\nAug 23, 2018"
    },
    {
        "articleId": "80018294",
        "title": "Ghost Roads VI: More abandoned roads of Maryland, Virginia",
        "blurb": "Ghost Roads VI: More abandoned roads of Maryland, Virginia. October 29, 2019. Courtesy of David Cuff. Dave Dildine | @DildineWTOP. October 29, 2019, 4:34 ...\nOct 29, 2019"
    },
    {
        "articleId": "80150002",
        "title": "Outdoor production of 'Macbeth' in Ellicott City casts its spell",
        "blurb": "“Double, double, toil and trouble.” The three Weird Sisters cast their spell over the cauldron in Chesapeake Shakespeare Company's outdoor ...\nJun 13, 2019"
    },
    {
        "articleId": "80109415",
        "title": "Baltimore County Council rejects bill that affordable housing developer said would kill Towson project",
        "blurb": "... Comprehensive Zoning Map Process that blocked a 50-unit project in Pikesville on land owned by St. Mark's on the Hill Episcopal Church.\nNov 17, 2020"
    },
    {
        "articleId": "48329483",
        "title": "St. Mary's College - Ellicott City, Maryland",
        "blurb": "The haunting 'Hell House Altar' is one of the few remnants of an abandoned college that has been a magnet for local legends.\nJun 1, 2013"
    }
]